In [1]:
"""Working With Missing Values"""

# missing values --> pandas.NA , None , numpy.nan , numpy.NaN

'Working With Missing Values'

In [2]:
# To find missing values : 
# 1.df.isna()
# 2.df.isnull()
# 3.df.notna()
# 4.df.notnull()

In [3]:
# Replace missing values :
# 1. df.fillna(value)
# 2. df.replace(to_replace=np.NaN,pd.NA,value)

In [4]:
# Replace missing values in column :
# 1. df["column_name"] = df["column_name"].fillna(fill value)
# 1. df[["column_name","column_name"]] = df[["column_name","column_name"]].fillna(fill value)

In [5]:
import numpy as np
import pandas as pd
d1 = {
    "First Score":[100,250,np.NAN,90],
    "Second Score":[100,250,np.NAN,pd.NA],
    "Third Score":[None,250,89,pd.NA]
}
# convert dictionary to dataframe
df = pd.DataFrame(d1)
print(df)

   First Score Second Score Third Score
0        100.0          100        None
1        250.0          250         250
2          NaN          NaN          89
3         90.0         <NA>        <NA>

In [7]:
# Finding missing values :
df.isna() # return boolean value where value is None or NaN it show True
df.isna().sum()

First Score     1
Second Score    2
Third Score     2
dtype: int64

In [9]:
# Finding missing values :
df.isnull() # also used for finding null values

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True          True        False
3        False          True         True

In [11]:
# column missing values
df["First Score"].isna() , df["Second Score"].isnull()

(0    False
 1    False
 2     True
 3    False
 Name: First Score, dtype: bool,
 0    False
 1    False
 2     True
 3     True
 Name: Second Score, dtype: bool)

In [1]:
"""Replacing missing values"""

'Replacing missing values'

In [2]:
# using fillna() replace missing values

import numpy as np
import pandas as pd
d1 = {
    "First Score":[100,250,np.NAN,90],
    "Second Score":[100,250,np.NAN,pd.NA],
    "Third Score":[None,250,89,pd.NA]
}
# convert dictionary to dataframe
df = pd.DataFrame(d1)
print(df)

   First Score Second Score Third Score
0        100.0          100        None
1        250.0          250         250
2          NaN          NaN          89
3         90.0         <NA>        <NA>

In [5]:
# replaced 0 insted of NaN
df.fillna(0,inplace=True)
df

   First Score  Second Score  Third Score
0        100.0           100            0
1        250.0           250          250
2          0.0             0           89
3         90.0             0            0

In [4]:
# replace is also used for replaing missing values
df

   First Score  Second Score  Third Score
0        100.0           100            0
1        250.0           250          250
2          0.0             0           89
3         90.0             0            0

In [6]:
import numpy as np
import pandas as pd
d1 = {
    "First Score":[100,250,np.NAN,90],
    "Second Score":[100,250,np.NAN,pd.NA],
    "Third Score":[None,250,89,pd.NA]
}
# convert dictionary to dataframe
df = pd.DataFrame(d1)
print(df)

   First Score Second Score Third Score
0        100.0          100        None
1        250.0          250         250
2          NaN          NaN          89
3         90.0         <NA>        <NA>

In [7]:
df.replace(to_replace=np.nan,value=0)

C:\Users\Ideapad\AppData\Local\Temp\ipykernel_3640\3001950159.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.replace(to_replace=np.nan,value=0)

   First Score  Second Score  Third Score
0        100.0           100            0
1        250.0           250          250
2          0.0             0           89
3         90.0             0            0

In [8]:
# replace NaN , None , NUll values in column

df["First Score"].replace(to_replace=np.NAN,value=78)

0    100.0
1    250.0
2     78.0
3     90.0
Name: First Score, dtype: float64

In [9]:
# replace NaN values of multiple columns

df[["Second Score","Third Score"]].fillna(99)

C:\Users\Ideapad\AppData\Local\Temp\ipykernel_3640\1346029493.py:3: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df[["Second Score","Third Score"]].fillna(99)

   Second Score  Third Score
0           100           99
1           250          250
2            99           89
3            99           99

In [12]:
d1 = {
    "TECT":["Python","Java","C#"],
    "Fees":[12000,np.NaN,10000],
    "Duration":["6 months","12 months",np.nan]
}
df = pd.DataFrame(d1)
print(df)

     TECT     Fees   Duration
0  Python  12000.0   6 months
1    Java      NaN  12 months
2      C#  10000.0        NaN

In [18]:
# updape Fees column for Java
df["Fees"]=20000.00
df

     TECT     Fees   Duration
0  Python  20000.0   6 months
1    Java  20000.0  12 months
2      C#  20000.0        NaN

In [21]:
# Replace duration of C#

df["Duration"].replace(to_replace=np.NaN,value="2 months",inplace=True)

In [22]:
df

     TECT     Fees   Duration
0  Python  20000.0   6 months
1    Java  20000.0  12 months
2      C#  20000.0   2 months